Merge pull request #53 from GDevWeb/session25_deployment
feat: Prepare for deployment
